RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_rcc.h
#define RCC_SYSCLK_Div1                 ((uint32_t)0x00000000)
#define RCC_SYSCLK_Div2                 ((uint32_t)0x00000080)
#define RCC_SYSCLK_Div4                 ((uint32_t)0x00000090)
#define RCC_SYSCLK_Div8                 ((uint32_t)0x000000A0)
#define RCC_SYSCLK_Div16                ((uint32_t)0x000000B0)
#define RCC_SYSCLK_Div64                ((uint32_t)0x000000C0)
#define RCC_SYSCLK_Div128               ((uint32_t)0x000000D0)
#define RCC_SYSCLK_Div256               ((uint32_t)0x000000E0)
#define RCC_SYSCLK_Div512               ((uint32_t)0x000000F0)
#define IS_RCC_AHBCLK(CLK)              (((CLK) == RCC_SYSCLK_Div1)   || ((CLK) == RCC_SYSCLK_Div2)   || \
                                         ((CLK) == RCC_SYSCLK_Div4)   || ((CLK) == RCC_SYSCLK_Div8)   || \
                                         ((CLK) == RCC_SYSCLK_Div16)  || ((CLK) == RCC_SYSCLK_Div64)  || \
                                         ((CLK) == RCC_SYSCLK_Div128) || ((CLK) == RCC_SYSCLK_Div256) || \
                                         ((CLK) == RCC_SYSCLK_Div512))
/**
  * @}
  */

/** @defgroup APB1_APB2_clock_source
  * @{
  */

#define RCC_AHBCLK_Div1                 ((uint32_t)0x00000000)
#define RCC_AHBCLK_Div2                 ((uint32_t)0x00000400)
#define RCC_AHBCLK_Div4                 ((uint32_t)0x00000500)
#define RCC_AHBCLK_Div8                 ((uint32_t)0x00000600)
#define RCC_AHBCLK_Div16                ((uint32_t)0x00000700)
#define IS_RCC_APBCLK(CLK)              (((CLK) == RCC_AHBCLK_Div1) || ((CLK) == RCC_AHBCLK_Div2) || \
                                         ((CLK) == RCC_AHBCLK_Div4) || ((CLK) == RCC_AHBCLK_Div8) || \
                                         ((CLK) == RCC_AHBCLK_Div16))
/**
  * @}
  */

/** @defgroup RCC_Interrupt_source
  * @{
  */

#define RCC_INT_LSISTBL                 ((uint8_t)0x01)
#define RCC_INT_LSESTBL                 ((uint8_t)0x02)
#define RCC_INT_HSISTBL                 ((uint8_t)0x04)
#define RCC_INT_HSESTBL                 ((uint8_t)0x08)
#define RCC_INT_PLLSTBL                 ((uint8_t)0x10)
#define RCC_INT_HSECFD                  ((uint8_t)0x80)

#define IS_RCC_INT_EN(INT)              ((((INT) & (uint8_t)0xE0) == 0x00) && ((INT) != 0x00))
#define IS_RCC_INT_STS(INT)             (((INT) == RCC_INT_LSISTBL) || ((INT) == RCC_INT_LSESTBL) || \
                                         ((INT) == RCC_INT_HSISTBL) || ((INT) == RCC_INT_HSESTBL) || \
                                         ((INT) == RCC_INT_PLLSTBL) || ((INT) == RCC_INT_HSECFD))
#define IS_RCC_INT_CLR(INT)             ((((INT) & (uint8_t)0x60) == 0x00) && ((INT) != 0x00))
/**
  * @}
  */

/** @defgroup USB_Device_clock_source
  * @{
  */
#define RCC_USBCLKSelection_PLL_Div1_5   ((uint32_t)0x00000000)
#define RCC_USBCLKSelection_PLL_Div1     ((uint32_t)0x00400000)
#define RCC_USBCLKSelection_PLL_Div2_5   ((uint32_t)0x00800000)
#define RCC_USBCLKSelection_PLL_Div2     ((uint32_t)0x00C00000)
#define RCC_USBCLKSelection_PLL_Div3_5   ((uint32_t)0x08000000)
#define RCC_USBCLKSelection_PLL_Div3     ((uint32_t)0x08400000)
#define RCC_USBCLKSelection_PLL_Div4     ((uint32_t)0x08800000)

#define IS_RCC_USBCLK_CFG(CFG)      (((CFG) == RCC_USBCLKSelection_PLL_Div1_5) || \
                                     ((CFG) == RCC_USBCLKSelection_PLL_Div1)   || \
                                     ((CFG) == RCC_USBCLKSelection_PLL_Div2_5) || \
                                     ((CFG) == RCC_USBCLKSelection_PLL_Div2)   || \
                                                                         ((CFG) == RCC_USBCLKSelection_PLL_Div3_5) || \
                                                                         ((CFG) == RCC_USBCLKSelection_PLL_Div3)   || \
                                                                         ((CFG) == RCC_USBCLKSelection_PLL_Div4))
/**
  * @}
  */

/** @defgroup ADC_clock_source
  * @{
  */

#define RCC_APB2CLK_Div2            ((uint32_t)0x00000000)
#define RCC_APB2CLK_Div4            ((uint32_t)0x00004000)
#define RCC_APB2CLK_Div6            ((uint32_t)0x00008000)
#define RCC_APB2CLK_Div8            ((uint32_t)0x0000C000)
#define RCC_APB2CLK_Div12           ((uint32_t)0x10004000)
#define RCC_APB2CLK_Div16           ((uint32_t)0x1000C000)
#define IS_RCC_ADCCLK(CLK)          (((CLK) == RCC_APB2CLK_Div2) || ((CLK) == RCC_APB2CLK_Div4) || \
                                     ((CLK) == RCC_APB2CLK_Div6) || ((CLK) == RCC_APB2CLK_Div8) || \
                                     ((CLK) == RCC_APB2CLK_Div12)|| ((CLK) == RCC_APB2CLK_Div16))
/**
  * @}
  */

/** @defgroup LSE_configuration
  * @{
  */

#define RCC_LSE_DISABLE             ((uint8_t)0x00)
#define RCC_LSE_ENABLE              ((uint8_t)0x01)
#define RCC_LSE_BYPASS              ((uint8_t)0x04)
#define IS_RCC_LSE(LSE)             (((LSE) == RCC_LSE_DISABLE) || ((LSE) == RCC_LSE_ENABLE) || \
                                     ((LSE) == RCC_LSE_BYPASS))
/**
  * @}
  */


#if defined (AT32F415xx)
/** @defgroup ERTC_clock_source
  * @{
  */
#define RCC_ERTCCLKSelection_LSE             ((uint32_t)0x00000100)
#define RCC_ERTCCLKSelection_LSI             ((uint32_t)0x00000200)
#define RCC_ERTCCLKSelection_HSE_Div128      ((uint32_t)0x00000300)
#define IS_RCC_ERTCCLK_SEL(SEL)              (((SEL) == RCC_ERTCCLKSelection_LSE) || \
                                              ((SEL)  == RCC_ERTCCLKSelection_LSI) || \
                                              ((SEL)  == RCC_ERTCCLKSelection_HSE_Div128))
#else
/** @defgroup RTC_clock_source
  * @{
  */
#define RCC_RTCCLKSelection_LSE             ((uint32_t)0x00000100)
#define RCC_RTCCLKSelection_LSI             ((uint32_t)0x00000200)
#define RCC_RTCCLKSelection_HSE_Div128      ((uint32_t)0x00000300)
#define IS_RCC_RTCCLK_SEL(SEL)              (((SEL) == RCC_RTCCLKSelection_LSE) || \
                                              ((SEL) == RCC_RTCCLKSelection_LSI) || \
                                              ((SEL) == RCC_RTCCLKSelection_HSE_Div128))
#endif
/**
  * @}
  */

/** @defgroup AHB_peripheral
  * @{
  */

#define RCC_AHBPERIPH_DMA1          ((uint32_t)0x00000001)
#define RCC_AHBPERIPH_DMA2          ((uint32_t)0x00000002)
#define RCC_AHBPERIPH_SRAM          ((uint32_t)0x00000004)
#define RCC_AHBPERIPH_FLASH         ((uint32_t)0x00000010)
#define RCC_AHBPERIPH_CRC           ((uint32_t)0x00000040)
#define RCC_AHBPERIPH_SDIO1         ((uint32_t)0x00000400)

