RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_rcc.h
#if defined (AT32F403xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
#define RCC_AHBPERIPH_XMC           ((uint32_t)0x00000100)
#define RCC_AHBPERIPH_SDIO2         ((uint32_t)0x00000800)
#endif

#if defined (AT32F403Axx) || defined (AT32F407xx)
#define RCC_AHBPERIPH_ETHMAC        ((uint32_t)0x00004000)
#define RCC_AHBPERIPH_ETHMACTX      ((uint32_t)0x00008000)
#define RCC_AHBPERIPH_ETHMACRX      ((uint32_t)0x00010000)
#define RCC_AHBPERIPH_ETHMACPTP     ((uint32_t)0x10000000)
#endif

#if defined (AT32F415xx)
#define RCC_AHBPERIPH_USB           ((uint32_t)0x00001000)
#endif

#if defined (AT32F403xx)
#define IS_RCC_AHB_PERIPH(PERIPH)   ((((PERIPH) & 0xFFFFF2A8) == 0x00) && ((PERIPH) != 0x00))
#elif defined (AT32F413xx)
#define IS_RCC_AHB_PERIPH(PERIPH)   ((((PERIPH) & 0xFFFFFBA8) == 0x00) && ((PERIPH) != 0x00))
#elif defined (AT32F415xx)
#define IS_RCC_AHB_PERIPH(PERIPH)   ((((PERIPH) & 0xFFFFEBA8) == 0x00) && ((PERIPH) != 0x00))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_RCC_AHB_PERIPH(PERIPH)   ((((PERIPH) & 0xEFFE32A8) == 0x00) && ((PERIPH) != 0x00))
#endif


/**
  * @}
  */

/** @defgroup APB2_peripheral
  * @{
  */

#define RCC_APB2PERIPH_AFIO         ((uint32_t)0x00000001)
#define RCC_APB2PERIPH_GPIOA        ((uint32_t)0x00000004)
#define RCC_APB2PERIPH_GPIOB        ((uint32_t)0x00000008)
#define RCC_APB2PERIPH_GPIOC        ((uint32_t)0x00000010)
#define RCC_APB2PERIPH_GPIOD        ((uint32_t)0x00000020)
#if !defined (AT32F403Axx) || !defined (AT32F407xx)
#define RCC_APB2PERIPH_GPIOF        ((uint32_t)0x00000080)
#endif
#define RCC_APB2PERIPH_ADC1         ((uint32_t)0x00000200)
#define RCC_APB2PERIPH_ADC2         ((uint32_t)0x00000400)
#define RCC_APB2PERIPH_TMR1         ((uint32_t)0x00000800)
#define RCC_APB2PERIPH_SPI1         ((uint32_t)0x00001000)
#define RCC_APB2PERIPH_USART1       ((uint32_t)0x00004000)
#define RCC_APB2PERIPH_TMR9         ((uint32_t)0x00080000)
#define RCC_APB2PERIPH_TMR10        ((uint32_t)0x00100000)
#define RCC_APB2PERIPH_TMR11        ((uint32_t)0x00200000)

#if defined (AT32F403xx)
#define RCC_APB2PERIPH_GPIOE        ((uint32_t)0x00000040)
#define RCC_APB2PERIPH_GPIOG        ((uint32_t)0x00000100)
#define RCC_APB2PERIPH_ADC3         ((uint32_t)0x00008000)
#define RCC_APB2PERIPH_TMR15        ((uint32_t)0x00010000)
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define RCC_APB2PERIPH_GPIOE        ((uint32_t)0x00000040)
#define RCC_APB2PERIPH_ADC3         ((uint32_t)0x00008000)
#define RCC_APB2PERIPH_I2C3         ((uint32_t)0x00800000)
#define RCC_APB2PERIPH_USART6       ((uint32_t)0x01000000)
#define RCC_APB2PERIPH_UART7        ((uint32_t)0x02000000)
#define RCC_APB2PERIPH_UART8        ((uint32_t)0x04000000)
#endif

#if !defined (AT32F415xx)
#define RCC_APB2PERIPH_TMR8         ((uint32_t)0x00002000)
#endif

#if !defined (AT32F403xx)
#define RCC_APB2PERIPH_ACC          ((uint32_t)0x00400000)
#endif

#if defined (AT32F415xx)
#define RCC_APB2PERIPH_EFCB         ((uint32_t)0x00800000)
#endif

#if defined (AT32F403xx)
#define IS_RCC_APB2_PERIPH(PERIPH)  ((((PERIPH) & 0xFFC60002) == 0x00) && ((PERIPH) != 0x00))
#elif defined (AT32F413xx)
#define IS_RCC_APB2_PERIPH(PERIPH)  ((((PERIPH) & 0xFF878142) == 0x00) && ((PERIPH) != 0x00))
#elif defined (AT32F415xx)
#define IS_RCC_APB2_PERIPH(PERIPH)  ((((PERIPH) & 0xFF078142) == 0x00) && ((PERIPH) != 0x00))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_RCC_APB2_PERIPH(PERIPH)  ((((PERIPH) & 0xF8070182) == 0x00) && ((PERIPH) != 0x00))
#endif

/**
  * @}
  */

/** @defgroup APB1_peripheral
  * @{
  */

#define RCC_APB1PERIPH_TMR2         ((uint32_t)0x00000001)
#define RCC_APB1PERIPH_TMR3         ((uint32_t)0x00000002)
#define RCC_APB1PERIPH_TMR4         ((uint32_t)0x00000004)
#define RCC_APB1PERIPH_TMR5         ((uint32_t)0x00000008)
#define RCC_APB1PERIPH_WWDG         ((uint32_t)0x00000800)
#define RCC_APB1PERIPH_SPI2         ((uint32_t)0x00004000)
#define RCC_APB1PERIPH_USART2       ((uint32_t)0x00020000)
#define RCC_APB1PERIPH_USART3       ((uint32_t)0x00040000)
#define RCC_APB1PERIPH_UART4        ((uint32_t)0x00080000)
#define RCC_APB1PERIPH_UART5        ((uint32_t)0x00100000)
#define RCC_APB1PERIPH_I2C1         ((uint32_t)0x00200000)
#define RCC_APB1PERIPH_I2C2         ((uint32_t)0x00400000)
#define RCC_APB1PERIPH_CAN1         ((uint32_t)0x02000000)
#define RCC_APB1PERIPH_PWR          ((uint32_t)0x10000000)

#if defined (AT32F403xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
#define RCC_APB1PERIPH_TMR6         ((uint32_t)0x00000010)
#define RCC_APB1PERIPH_TMR7         ((uint32_t)0x00000020)
#define RCC_APB1PERIPH_TMR12        ((uint32_t)0x00000040)
#define RCC_APB1PERIPH_TMR13        ((uint32_t)0x00000080)
#define RCC_APB1PERIPH_TMR14        ((uint32_t)0x00000100)
#define RCC_APB1PERIPH_SPI3         ((uint32_t)0x00008000)
#define RCC_APB1PERIPH_SPI4         ((uint32_t)0x00010000)
#define RCC_APB1PERIPH_I2C3         ((uint32_t)0x04000000)
#define RCC_APB1PERIPH_DAC          ((uint32_t)0x20000000)
#endif

#if defined (AT32F413xx)
#define RCC_APB1PERIPH_CAN2         ((uint32_t)0x80000000)
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define RCC_APB1PERIPH_CAN2         ((uint32_t)0x04000000)
#endif

#if !defined (AT32F415xx)
#define RCC_APB1PERIPH_USB          ((uint32_t)0x00800000)
#define RCC_APB1PERIPH_BKP          ((uint32_t)0x08000000)
#else
#define RCC_APB1PERIPH_COMP         ((uint32_t)0x00000200)
#endif

#if defined (AT32F403xx)
#define IS_RCC_APB1_PERIPH(PERIPH)  ((((PERIPH) & 0xC1003600) == 0x00) && ((PERIPH) != 0x00))
#elif defined (AT32F413xx)
#define IS_RCC_APB1_PERIPH(PERIPH)  ((((PERIPH) & 0x6501B7F0) == 0x00) && ((PERIPH) != 0x00))
#elif defined (AT32F415xx)
#define IS_RCC_APB1_PERIPH(PERIPH)  ((((PERIPH) & 0xED81B3F0) == 0x00) && ((PERIPH) != 0x00))
#elif defined (AT32F403Axx) || defined (AT32F407xx)
#define IS_RCC_APB1_PERIPH(PERIPH)  ((((PERIPH) & 0xC1003600) == 0x00) && ((PERIPH) != 0x00))
#endif
/**
  * @}
  */

/** @defgroup Clock_source_to_output_on_CLKOUT_pin
  * @{
  */
#define RCC_CLKOUT_NOCLK            ((uint32_t)0x00000000)
#define RCC_CLKOUT_SYSCLK           ((uint32_t)0x04000000)
#define RCC_CLKOUT_HSI              ((uint32_t)0x05000000)
#define RCC_CLKOUT_HSE              ((uint32_t)0x06000000)
#define RCC_CLKOUT_PLL_Div2         ((uint32_t)0x07000000)
#define RCC_CLKOUT_PLL_Div4         ((uint32_t)0x14000000)
#define RCC_CLKOUT_USB              ((uint32_t)0x15000000)
#define RCC_CLKOUT_ADC              ((uint32_t)0x16000000)
#if !defined (AT32F403xx)
#define RCC_CLKOUT_LSI              ((uint32_t)0x02000000)
#define RCC_CLKOUT_LSE              ((uint32_t)0x03000000)
#endif
#if !defined (AT32F403xx)
#define IS_RCC_CLKOUT(CLK)          (((CLK) == RCC_CLKOUT_NOCLK)    || ((CLK) == RCC_CLKOUT_HSI)      || \
                                     ((CLK) == RCC_CLKOUT_SYSCLK)   || ((CLK) == RCC_CLKOUT_HSE)      || \
                                     ((CLK) == RCC_CLKOUT_PLL_Div2) || ((CLK) == RCC_CLKOUT_PLL_Div4) || \
                                     ((CLK) == RCC_CLKOUT_USB)      || ((CLK) == RCC_CLKOUT_ADC)      || \
                                     ((CLK) == RCC_CLKOUT_LSI)      || ((CLK) == RCC_CLKOUT_LSE))
#else
#define IS_RCC_CLKOUT(CLK)          (((CLK) == RCC_CLKOUT_NOCLK)    || ((CLK) == RCC_CLKOUT_HSI)      || \
                                     ((CLK) == RCC_CLKOUT_SYSCLK)   || ((CLK) == RCC_CLKOUT_HSE)      || \
                                     ((CLK) == RCC_CLKOUT_PLL_Div2) || ((CLK) == RCC_CLKOUT_PLL_Div4) || \
                                     ((CLK) == RCC_CLKOUT_USB)      || ((CLK) == RCC_CLKOUT_ADC))
#endif

/**
  * @}
  */

/** @defgroup HSE_Divider
  * @{
  */
#define RCC_HSE_DIV_MASK            RCC_MISC2_HSE_DIV_CTRL
#define RCC_HSE_DIV_2               RCC_MISC2_HSE_DIV_CTRL_2
#define RCC_HSE_DIV_3               RCC_MISC2_HSE_DIV_CTRL_3
#define RCC_HSE_DIV_4               RCC_MISC2_HSE_DIV_CTRL_4
#define RCC_HSE_DIV_5               RCC_MISC2_HSE_DIV_CTRL_5

#define IS_RCC_HSEDIV(CLK)          (((CLK) == RCC_HSE_DIV_2) || ((CLK) == RCC_HSE_DIV_3) || \
                                     ((CLK) == RCC_HSE_DIV_4) || ((CLK) == RCC_HSE_DIV_5))
/**
  * @}
  */

/** @defgroup Clock_source_to_output_MCOPRE
  * @{
  */
#define  RCC_MCOPRE_MASK            RCC_MISC_MCOPRE_MASK
#define  RCC_MCOPRE_1               RCC_MISC_MCOPRE_1
#define  RCC_MCOPRE_2               RCC_MISC_MCOPRE_2
#define  RCC_MCOPRE_4               RCC_MISC_MCOPRE_4
#define  RCC_MCOPRE_8               RCC_MISC_MCOPRE_8
#define  RCC_MCOPRE_16              RCC_MISC_MCOPRE_16
#define  RCC_MCOPRE_64              RCC_MISC_MCOPRE_64
#define  RCC_MCOPRE_128             RCC_MISC_MCOPRE_128
#define  RCC_MCOPRE_256             RCC_MISC_MCOPRE_256
#define  RCC_MCOPRE_512             RCC_MISC_MCOPRE_512

#if !defined (AT32F403xx)
#define IS_RCC_MCO(MCOPRE)          (((MCOPRE) == RCC_MCOPRE_1)    || ((MCOPRE) == RCC_MCOPRE_2)      || \
                                     ((MCOPRE) == RCC_MCOPRE_4)    || ((MCOPRE) == RCC_MCOPRE_8)      || \
                                     ((MCOPRE) == RCC_MCOPRE_16)   || ((MCOPRE) == RCC_MCOPRE_64)     || \
                                     ((MCOPRE) == RCC_MCOPRE_128)  || ((MCOPRE) == RCC_MCOPRE_256)    || \
                                     ((MCOPRE) == RCC_MCOPRE_512))
#endif
/**
  * @}
  */

/** @defgroup RCC_Flag
  * @{
  */

#define RCC_FLAG_HSISTBL            ((uint8_t)0x21)
#define RCC_FLAG_HSESTBL            ((uint8_t)0x31)
#define RCC_FLAG_PLLSTBL            ((uint8_t)0x39)
#define RCC_FLAG_LSESTBL            ((uint8_t)0x41)
#define RCC_FLAG_LSISTBL            ((uint8_t)0x61)
#define RCC_FLAG_PINRST             ((uint8_t)0x7A)
#define RCC_FLAG_PORST              ((uint8_t)0x7B)
#define RCC_FLAG_SWRST              ((uint8_t)0x7C)
#define RCC_FLAG_IWDGRST            ((uint8_t)0x7D)
#define RCC_FLAG_WWDGRST            ((uint8_t)0x7E)
#define RCC_FLAG_LPRST              ((uint8_t)0x7F)

#define IS_RCC_FLAG(FLAG)           (((FLAG) == RCC_FLAG_HSISTBL) || ((FLAG) == RCC_FLAG_HSESTBL) || \
                                     ((FLAG) == RCC_FLAG_PLLSTBL) || ((FLAG) == RCC_FLAG_LSESTBL) || \
                                     ((FLAG) == RCC_FLAG_LSISTBL) || ((FLAG) == RCC_FLAG_PINRST)  || \
                                     ((FLAG) == RCC_FLAG_PORST)   || ((FLAG) == RCC_FLAG_SWRST)   || \
                                     ((FLAG) == RCC_FLAG_IWDGRST) || ((FLAG) == RCC_FLAG_WWDGRST) || \
                                     ((FLAG) == RCC_FLAG_LPRST))
#if defined (AT32F403xx)
#define IS_RCC_TWEAK_VALUE(VALUE)    ((VALUE) <= 0x1F)
#else
#define IS_RCC_TWEAK_VALUE(VALUE)    ((VALUE) <= 0x3F)
#endif
#define IS_RCC_CALIB_VALUE(VALUE)    ((VALUE) <= 0xFF)

/**
  * @}
  */

/**
  * @}
  */

