RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/inc/at32f4xx_rcc.h
#if defined (AT32F415xx)
/** @defgroup RCC_PLL_Register_For_F415
  * @{
  */
#define PLL_FR_POS                   0
#define PLL_FR_MASK                  ((uint32_t)0x00000007)
#define PLL_FR_1                     ((uint32_t)0x00000000)
#define PLL_FR_2                     ((uint32_t)0x00000001)
#define PLL_FR_4                     ((uint32_t)0x00000002)
#define PLL_FR_8                     ((uint32_t)0x00000003)
#define PLL_FR_16                    ((uint32_t)0x00000004)
#define PLL_FR_32                    ((uint32_t)0x00000005)

#define PLL_MS_POS                   4
#define PLL_MS_MASK                  ((uint32_t)0x000000F0)

#define PLL_NS_POS                   8
#define PLL_NS_MASK                  ((uint32_t)0x0000FF00)

#define PLL_FREF_POS                 24
#define PLL_FREF_MASK                ((uint32_t)0x07000000)
#define PLL_FREF_4M                  ((uint32_t)0x00000000)
#define PLL_FREF_6M                  ((uint32_t)0x01000000)
#define PLL_FREF_8M                  ((uint32_t)0x02000000)
#define PLL_FREF_12M                 ((uint32_t)0x03000000)
#define PLL_FREF_16M                 ((uint32_t)0x04000000)
#define PLL_FREF_25M                 ((uint32_t)0x05000000)

#define PLL_CFGGEN_POS               31
#define PLL_CFGEN_ENABLE             ((uint32_t)0x80000000)
#define PLL_CFGEN_MASK               ((uint32_t)0x80000000)

#define IS_RCC_FR(PLL_FR)            (((PLL_FR) == PLL_FR_1)    || ((PLL_FR) == PLL_FR_2)      || \
                                      ((PLL_FR) == PLL_FR_4)    || ((PLL_FR) == PLL_FR_8)      || \
                                      ((PLL_FR) == PLL_FR_16)   || ((PLL_FR) == PLL_FR_32))

#define IS_RCC_FREF(PLL_FREF)        (((PLL_FREF) == PLL_FREF_4M)  || ((PLL_FREF) == PLL_FREF_6M)    || \
                                      ((PLL_FREF) == PLL_FREF_8M)  || ((PLL_FREF) == PLL_FREF_12M)   || \
                                      ((PLL_FREF) == PLL_FREF_16M) || ((PLL_FREF) == PLL_FREF_25M))

#define IS_RCC_MS_VALUE(VALUE)       (((VALUE) >= 0x1) && ((VALUE) <= 0xF))
#define IS_RCC_NS_VALUE(VALUE)       (((VALUE) >= 0x1F) && ((VALUE) <= 0x1F4))
#define IS_RCC_RESULT_VALUE(VALUE)   (((VALUE) >= 0x1F4) && ((VALUE) <= 0x3E8))

#define RCC_FREF_VALUE(VALUE, RET)   do                         \
                                     {                          \
                                       switch (VALUE)           \
                                       {                        \
                                         case PLL_FREF_4M:      \
                                         RET = 4;               \
                                         break;                 \
                                         case PLL_FREF_6M:      \
                                         RET = 6;               \
                                         break;                 \
                                         case PLL_FREF_8M:      \
                                         RET = 8;               \
                                         break;                 \
                                         case PLL_FREF_12M:     \
                                         RET = 12;              \
                                         break;                 \
                                         case PLL_FREF_16M:     \
                                         RET = 16;              \
                                         break;                 \
                                         case PLL_FREF_25M:     \
                                         RET = 25;              \
                                         break;                 \
                                         default:               \
                                         RET = 0;               \
                                         break;                 \
                                       }                        \
                                     }while(0)

#define RCC_FR_VALUE(VALUE, RET)     do                         \
                                     {                          \
                                       switch (VALUE)           \
                                       {                        \
                                         case PLL_FR_1:         \
                                         RET = 1;               \
                                         break;                 \
                                         case PLL_FR_2:         \
                                         RET = 2;               \
                                         break;                 \
                                         case PLL_FR_4:         \
                                         RET = 4;               \
                                         break;                 \
                                         case PLL_FR_8:         \
                                         RET = 8;               \
                                         break;                 \
                                         case PLL_FR_16:        \
                                         RET = 16;              \
                                         break;                 \
                                         case PLL_FR_32:        \
                                         RET = 32;              \
                                         break;                 \
                                         default:               \
                                         RET = 1;               \
                                         break;                 \
                                       }                        \
                                     }while(0)
/**
  * @}
  */
#endif

/**
  * @}
  */

/** @defgroup RCC_Exported_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup RCC_Exported_Functions
  * @{
  */

void RCC_Reset(void);
void RCC_HSEConfig(uint32_t RCC_HSE);
ErrorStatus RCC_WaitForHSEStable(void);
void RCC_SetHSITweakValue(uint8_t HSITweakValue);
void RCC_SetHSICalibValue(uint8_t HSICalibValue);
void RCC_HSICmd(FunctionalState NewState);
void RCC_PLLConfig(uint32_t RCC_PLLRefClk, uint32_t RCC_PLLMult, uint32_t RCC_PLLRange);
void RCC_PLLCmd(FunctionalState NewState);
void RCC_SYSCLKConfig(uint32_t RCC_SYSCLKSelect);
uint8_t RCC_GetSYSCLKSelction(void);
void RCC_AHBCLKConfig(uint32_t RCC_SYSCLK_Div);
void RCC_APB1CLKConfig(uint32_t RCC_HCLK_Div);
void RCC_APB2CLKConfig(uint32_t RCC_HCLK_Div);
void RCC_INTConfig(uint8_t RCC_INT, FunctionalState NewState);
void RCC_ADCCLKConfig(uint32_t RCC_PCLK2_Div);
void RCC_LSEConfig(uint8_t RCC_LSE);
void RCC_LSICmd(FunctionalState NewState);
#if defined (AT32F415xx)
void RCC_ERTCCLKConfig(uint32_t RCC_ERTCCLKSelect);
void RCC_ERTCCLKCmd(FunctionalState NewState);
#else
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSelect);
void RCC_RTCCLKCmd(FunctionalState NewState);
#endif
void RCC_GetClocksFreq(RCC_ClockType* RCC_Clocks);
void RCC_AHBPeriphClockCmd(uint32_t RCC_AHBPeriph, FunctionalState NewState);
void RCC_APB2PeriphClockCmd(uint32_t RCC_APB2Periph, FunctionalState NewState);
void RCC_APB1PeriphClockCmd(uint32_t RCC_APB1Periph, FunctionalState NewState);
#if defined (AT32F403Axx) || defined (AT32F407xx)
void RCC_AHBPeriphResetCmd(uint32_t RCC_AHBPeriph, FunctionalState NewState);
#endif
void RCC_APB2PeriphResetCmd(uint32_t RCC_APB2Periph, FunctionalState NewState);
void RCC_APB1PeriphResetCmd(uint32_t RCC_APB1Periph, FunctionalState NewState);
void RCC_BackupResetCmd(FunctionalState NewState);
void RCC_HSEClockFailureDetectorCmd(FunctionalState NewState);
#if defined (AT32F403xx)
void RCC_CLKOUTConfig(uint32_t RCC_CLKOUT);
#else
void RCC_CLKOUTConfig(uint32_t RCC_CLKOUT, uint32_t RCC_CLKOUTPRE);
#endif
FlagStatus RCC_GetFlagStatus(uint8_t RCC_Flag);
void RCC_ClearFlag(void);
ITStatus RCC_GetINTStatus(uint8_t RCC_INT);
void RCC_ClearINTPendingBit(uint8_t RCC_INT);
void RCC_USBCLKConfig(uint32_t RCC_USBCLKSelect);
void RCC_StepModeCmd(FunctionalState NewState);
void RCC_USBINTRemap(FunctionalState NewState);
void RCC_HSI2USB48M(FunctionalState NewState);
void RCC_MCO2TMR10(FunctionalState NewState);
#if defined (AT32F415xx)
void RCC_PLLconfig2(uint32_t PLL_FREF, uint32_t PLL_NS, uint32_t PLL_MS, \
                    uint32_t PLL_FR);
#endif
#if defined (AT32F403Axx) || defined (AT32F407xx)
void RCC_HSEDivConfig(uint32_t HSEDiv);
#endif

#ifdef __cplusplus
}
#endif

#endif /* __AT32F4xx_RCC_H */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */


